In [1]:
import numpy as np
import pandas as pd

# For Series

In [4]:
s1 = pd.Series(np.arange(5),index=['A','B','C','D','E'])

In [5]:
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [6]:
s1['B']

1

In [9]:
s1[['A','B','E']]

A    0
B    1
E    4
dtype: int64

In [10]:
s1[0:3]

A    0
B    1
C    2
dtype: int64

In [11]:
s1>2

A    False
B    False
C    False
D     True
E     True
dtype: bool

In [12]:
s1[s1>2]

D    3
E    4
dtype: int64

In [13]:
s1[s1>3]=10

In [14]:
s1

A     0
B     1
C     2
D     3
E    10
dtype: int64

In [15]:
# For DataFrame

In [16]:
df1 = pd.DataFrame(np.random.randn(4,5), index=['r1','r2','r3','r4'], columns=['c1','c2','c3','c4', 'c5'])

In [17]:
df1

          c1        c2        c3        c4        c5
r1  0.514278 -0.238319 -0.742319 -0.476291 -0.093831
r2  1.051800  1.036690 -1.110195  0.331919  0.106662
r3  0.782274  1.056322 -0.309076 -1.445076 -0.202399
r4 -1.534372  0.456702 -0.272296  0.084115 -1.728321

In [18]:
df1['c1']

r1    0.514278
r2    1.051800
r3    0.782274
r4   -1.534372
Name: c1, dtype: float64

In [20]:
df1[['c1','c4','c3']]

          c1        c4        c3
r1  0.514278 -0.476291 -0.742319
r2  1.051800  0.331919 -1.110195
r3  0.782274 -1.445076 -0.309076
r4 -1.534372  0.084115 -0.272296

In [21]:
df1[df1['c2']>0] #extract columns elements

          c1        c2        c3        c4        c5
r2  1.051800  1.036690 -1.110195  0.331919  0.106662
r3  0.782274  1.056322 -0.309076 -1.445076 -0.202399
r4 -1.534372  0.456702 -0.272296  0.084115 -1.728321

In [23]:
df1.loc['r2'] #extract row elements

c1    1.051800
c2    1.036690
c3   -1.110195
c4    0.331919
c5    0.106662
Name: r2, dtype: float64

In [25]:
df1.iloc[1] #extract r2 row

c1    1.051800
c2    1.036690
c3   -1.110195
c4    0.331919
c5    0.106662
Name: r2, dtype: float64

In [26]:
df1.iloc[[0,2,3],[0,2]] # iloc can used to index both columns and rows

          c1        c3
r1  0.514278 -0.742319
r3  0.782274 -0.309076
r4 -1.534372 -0.272296

In [27]:
df2 = df1.copy()

In [28]:
df2['c6'] = ['one', 'one','two','three']

In [29]:
df2

          c1        c2        c3        c4        c5     c6
r1  0.514278 -0.238319 -0.742319 -0.476291 -0.093831    one
r2  1.051800  1.036690 -1.110195  0.331919  0.106662    one
r3  0.782274  1.056322 -0.309076 -1.445076 -0.202399    two
r4 -1.534372  0.456702 -0.272296  0.084115 -1.728321  three

In [30]:
df2['c6'].isin(['two','three'])#check if column c6 includes the elements in isin();

r1    False
r2    False
r3     True
r4     True
Name: c6, dtype: bool